#==============================================================================
# ■ 設定項目
#==============================================================================
module TBOSS
  RESULT_CLEAR_ID = 1           # クリアしたかどうかを代入するスイッチのID
  GC_COUNT = 120                # GCを実行する間隔(フレーム数)
  SE_NAME = []
  SE_NAME[1] = ["Ice9.ogg", 80, 150]   # 敵ダメージ効果音
  SE_NAME[2] = ["Explosion1.ogg", 80, 100]   # 敵撃破効果音
  SE_NAME[3] = ["Z1 爆発1.ogg", 100, 100]    # 自機爆発効果音
  SE_NAME[4] = ["Up.ogg", 80, 150]    # チャージ効果音
  #SE_NAME[5] = ["Z3 エネルギー波.ogg", 80, 100]    # ショット１効果音
  SE_NAME[5] = "Z3 エネルギー波.ogg"    # ショット１効果音
  SE_NAME[6] = ["Heal5.ogg", 80, 150]    # ショット２効果音
  SE_NAME[7] = ["Water4.ogg", 80, 150]    # ショット３効果音
end

#==============================================================================
# ■ ボス１
#==============================================================================
class TBoss_Enemy1 < TBoss_Enemy
  def set_type
    @file_name = "Actor1"   # ボスの画像ファイル
    @file_index = 1         # ボスの画像インデックス
  end
  def action
    
    if $shoot_end != true
      if $shoot_enemy_state == 0      # 状態０：右側で待機
        if $shoot_player_y > $shoot_enemy_y
          @vy = 1500
        elsif $shoot_player_y < $shoot_enemy_y
          @vy = -1500
        else
          @vy = 0
        end
        if @cnt >= 60 # 90フレーム経過したら
          @cnt = 0    # カウンタリセット
        end
        nway_shot(1, 0.2, 0.0, 4500, true, 2, 0) if @cnt == 15 # 30フレーム目に攻撃
        nway_shot(1, 0.2, 0.0, 4500, true, 2, 0) if @cnt == 50 # 30フレーム目に攻撃
        Audio.se_play("Audio/SE/"+TBOSS::SE_NAME[5]) if @cnt == 35
      elsif $shoot_enemy_state == 1
        if $shoot_player_y > $shoot_enemy_y
          @vy = 2000
        elsif $shoot_player_y < $shoot_enemy_y
          @vy = -2000
        else
          @vy = 0
        end
        if @cnt >= 60 # 90フレーム経過したら
          @cnt = 0    # カウンタリセット
        end
        pursuit_shot(1, 0.2, 0.0, 4500, true, 2, 0) if @cnt == 15 # 30フレーム目に攻撃
        nway_shot(1, 0.2, 0.0, 6500, true, 2, 0) if @cnt == 30 && rand(4) == 1# 30フレーム目に攻撃
        pursuit_shot(1, 0.2, 0.0, 4500, true, 2, 0) if @cnt == 50 # 30フレーム目に攻撃
        Audio.se_play("Audio/SE/"+TBOSS::SE_NAME[5]) if @cnt == 35
      end  
    else
    @vy = 0
    @vx = 1500
    
    end
    #elsif @state == 1   # 状態１：左側へ大ジャンプ
    #  if self.x <= 64 # 左端まで移動したら
    #    @state = 2  # 次の状態へ移行
    #    @cnt = 0    # カウンタリセット
    #    @vx = 0     # 移動速度をセット
    #    @dir = 6    # 右を向く
    #  end
      #jump(-4096)
    #elsif @state == 2   # 状態２：左側で待機
    #  if @cnt == 90 # 90フレーム経過したら
    #    @state = 3  # 次の状態へ移行
    #    @cnt = 0    # カウンタリセット
    #    @vx = 8192  # 移動速度をセット
    #  end
    #  nway_shot(1, 0.2, 0.0, 5500, true, 2, 1) if @cnt == 30 # 30フレーム目に攻撃
    #  nway_shot(1, 0.0, 0.0, 5500, true, 1, 1) if @cnt == 40 # 40フレーム目に攻撃
    #elsif @state == 3   # 状態３：右側へダッシュ
    #  if self.x > 640-64 # 左端まで移動したら
    #    @state = 0  # 次の状態へ移行
    #    @cnt = 0    # カウンタリセット
    #    @vx = 0     # 移動速度をセット
    #    @dir = 4    # 左を向く
    #  end
    #end
    #@vy += 128  # 重力
  end
  def dispose # オブジェクト開放時の処理
    $scene.change_state(1) if @hp <= 0  # HPが0になったらシーン状態変更
    super
  end
end

#==============================================================================
# ■ 敵機タイプ２
#------------------------------------------------------------------------------
# 　未登録
#==============================================================================
class TBoss_Enemy2 < TBoss_Enemy
  def set_type
    @file_name = "Monster"
    @file_index = 0
  end
  def action
  end
end

#==============================================================================
# ■ 敵機タイプ３
#------------------------------------------------------------------------------
# 　未登録
#==============================================================================
class TBoss_Enemy3 < TBoss_Enemy
  def set_type
    @file_name = "Monster"
    @file_index = 0
  end
  def action
  end
end

#==============================================================================
# ■ 敵機タイプ４
#------------------------------------------------------------------------------
# 　未登録
#==============================================================================
class TBoss_Enemy4 < TBoss_Enemy
  def set_type
    @file_name = "Monster"
    @file_index = 0
  end
  def action
  end
end

#==============================================================================
# ■ 敵機タイプ５
#------------------------------------------------------------------------------
# 　未登録
#==============================================================================
class TBoss_Enemy5 < TBoss_Enemy
  def set_type
    @file_name = "Monster"
    @file_index = 0
  end
  def action
  end
end

#==============================================================================
# ■ 敵機タイプ６
#------------------------------------------------------------------------------
# 　未登録
#==============================================================================
class TBoss_Enemy6 < TBoss_Enemy
  def set_type
    @file_name = "Monster"
    @file_index = 0
  end
  def action
  end
end

#==============================================================================
# ■ 敵機タイプ７
#------------------------------------------------------------------------------
# 　未登録
#==============================================================================
class TBoss_Enemy7 < TBoss_Enemy
  def set_type
    @file_name = "Monster"
    @file_index = 0
  end
  def action
  end
end

#==============================================================================
# ■ 敵機タイプ８
#------------------------------------------------------------------------------
# 　未登録
#==============================================================================
class TBoss_Enemy8 < TBoss_Enemy
  def set_type
    @file_name = "Monster"
    @file_index = 0
  end
  def action
  end
end





